Repository: ResistanceTo/DevForge
Catalog: DevForge/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld characters
zh_hans: %lld 字符

source: About
zh_hans: 关于

source: Amount: %lld
zh_hans: 数量： %lld

source: Appearance
zh_hans: 样式

source: Binary
zh_hans: 二进制

source: By Characters
zh_hans: 按字符

source: By Lines
zh_hans: 按行

source: By Words
zh_hans: 按词

source: Bytes
zh_hans: 字节

source: Calculated Checksum
zh_hans: 校验和

source: Case Insensitive
zh_hans: 不区分大小写

source: Characters
zh_hans: 字符

source: Checksum will appear here
zh_hans: 校验和将显示在此处

source: Choose your favorite app icon to personalize your DevForge experience:
zh_hans: 选择您最喜爱的应用图标，个性化您的DevForge体验：

source: Clear
zh_hans: 清空

source: Click 'Generate' to create UUIDs.
zh_hans: 点击“生成”按钮创建UUID。

source: Compare With
zh_hans: 校验

source: Configuration
zh_hans: 配置

source: Control which tools appear in the sidebar
zh_hans: 控制侧边栏中显示的工具

source: Converted Formats
zh_hans: 转换格式

source: Converted Values
zh_hans: 转换结果

source: Converters
zh_hans: 转换类

source: Copy
zh_hans: 拷贝

source: Copy All
zh_hans: 拷贝全部

source: Copy Image
zh_hans: 拷贝图片

source: Count: %lld
zh_hans: 数量: %lld

source: Customize the appearance of the application
zh_hans: 自定义应用程序的外观

source: Dark
zh_hans: 黑暗

source: Decimal
zh_hans: 十进制

source: Decoded Content (%lld)
zh_hans: 解码内容 (%lld)

source: Decoded URL
zh_hans: 解码后的URL

source: Deserialization Failed
zh_hans: 反序列化失败

source: DevForge is a powerful toolkit designed for developers, providing a collection of essential utilities to streamline your daily workflow.
zh_hans: DevForge 是一款专为开发者打造的强大工具包，提供一系列必备实用工具，助您优化日常工作流程。

source: Diff Style
zh_hans: 风格

source: Done
zh_hans: 完成

source: Dot Matches Newlines
zh_hans: 点匹配换行符

source: Encoded URL
zh_hans: 编码后的URL

source: Encoders / Decoders
zh_hans: 编码/解码类

source: Enter a valid URL to see its components.
zh_hans: 输入有效的URL以查看其组成部分。

source: Enter your regular expression here
zh_hans: 在此处输入您的正则表达式

source: Failed to convert file address
zh_hans: 文件地址转换失败

source: File
zh_hans: 文件

source: File Checksum
zh_hans: 文件校验和

source: File not found
zh_hans: 找不到文件

source: Formatted Output
zh_hans: 格式化输出

source: Formatter
zh_hans: 格式化

source: Formatters
zh_hans: 格式化类

source: Generate
zh_hans: 生成

source: Generators
zh_hans: 生成类

source: Group %lld:
zh_hans: 组 %lld:

source: Hash Algorithm
zh_hans: 哈希算法

source: Hash Results
zh_hans: 哈希结果

source: Hexadecimal
zh_hans: 十六进制

source: Home
zh_hans: 首页

source: HTML Entities
zh_hans: HTML实体

source: Include Hyphens (-)
zh_hans: 包含连字符（-）

source: Information
zh_hans: 信息

source: Input
zh_hans: 输入

source: Input 1
zh_hans: 输入 1

source: Input 2
zh_hans: 输入 2

source: Input JSON
zh_hans: JSON输入

source: Light
zh_hans: 明亮

source: Lines
zh_hans: 行

source: Load file failed
zh_hans: 加载文件失败

source: Lorem Ipsum
zh_hans: 哑元文本

source: Match Results (%lld)
zh_hans: 匹配结果 (%lld)

source: No capture groups found.
zh_hans: 未找到捕获组。

source: No QR code detected yet.
zh_hans: 尚未检测到二维码。

source: Octal
zh_hans: 八进制

source: Official Website
zh_hans: 官网

source: Open File...
zh_hans: 打开文件...

source: Output
zh_hans: 输出

source: Parsed Components
zh_hans: 解析输出

source: Paste
zh_hans: 粘贴

source: Paste a checksum to compare
zh_hans: 粘贴校验和进行比较

source: Paste a JWT in the field above to see the decoded results.
zh_hans: 在上面字段中粘贴一个JWT，即可查看解码结果。

source: Plain Text
zh_hans: 纯文本

source: Preview
zh_hans: 预览

source: QR Code
zh_hans: 二维码

source: Query Parameters (%lld)
zh_hans: 查询参数 (%lld)

# Range: %lld-%lld
source: Range: %1$lld-%2$lld
zh_hans: 范围: %1$lld-%2$lld

source: Regex
zh_hans: 正则

source: Regex Cheatsheet
zh_hans: 正则表达式速查表

source: Regular Expression
zh_hans: 正则表达式

source: Results (%lld)
zh_hans: 结果 (%lld)

source: Save As...
zh_hans: 另存为…

source: Save Image...
zh_hans: 保存图片...

source: Select Color
zh_hans: 选择颜色

source: Select or drop a file here
zh_hans: 在此处选择或拖放文件

source: Serialization Failed
zh_hans: 序列化失败

source: Signature
zh_hans: 签名

source: Signature cannot be verified without the secret key.
zh_hans: 没有私钥就无法验证签名。

source: Sponsor me to keep developing!
zh_hans: 请支持我，让我持续开发！

source: Supporter Exclusive Icons
zh_hans: 支持者专属图标

source: System
zh_hans: 系统

source: Technology Stack
zh_hans: 技术栈

source: Text
zh_hans: 文本

source: Thank You for Your Support!
zh_hans: 感谢您的支持！

source: Theme
zh_hans: 主题

source: Toggle Layout
zh_hans: 切换布局

source: Tools
zh_hans: 工具

source: Transform
zh_hans: 转换

source: Type
zh_hans: 类型

source: Unsupported file type or failed to access file
zh_hans: 不支持的文件类型或无法访问文件

source: Uppercase (A-Z)
zh_hans: 大写

source: Uppercase Output
zh_hans: 大写输出

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@ (%2$@)

source: Waiting for Input
zh_hans: 等待输入

source: Words
zh_hans: 词

source: Your sponsorship is the greatest motivation for me to continue developing and maintaining DevForge. As a token of appreciation, you can choose from these exclusive app icons.
zh_hans: 您的赞助是我持续开发和维护DevForge的最大动力。作为感谢，您可以从这些专属应用图标中任选其一。
